tutorials/Ka4-70/system/elementData
// Blade element data
// axialDistance, radius, azimuth, chord, chordMount, twist
(0.0    0.01      0.0     0.020145    0.25     53.52825213)
(0.0    0.01125   0.0     0.020853    0.25     50.65784052)
(0.0    0.0125    0.0     0.021561    0.25     47.78742891)
(0.0    0.01375   0.0     0.022269    0.25     44.9170173)
(0.0    0.015     0.0     0.022977    0.25     42.04660568)
(0.0    0.01625   0.0     0.023622    0.25     40.053643)
(0.0    0.0175    0.0     0.024267    0.25     38.06068033)
(0.0    0.01875   0.0     0.024912    0.25     36.06771765)
(0.0    0.02      0.0     0.025557    0.25     34.07475497)
(0.0    0.02125   0.0     0.0261435   0.25     32.66081828)
(0.0    0.0225    0.0     0.02673     0.25     31.2468816)
(0.0    0.02375   0.0     0.0273165   0.25     29.83294492)
(0.0    0.025     0.0     0.027903    0.25     28.41900823)
(0.0    0.02625   0.0     0.02842725  0.25     27.38237382)
(0.0    0.0275    0.0     0.0289515   0.25     26.34573941)
(0.0    0.02875   0.0     0.02947575  0.25     25.309105)
(0.0    0.03      0.0     0.03        0.25     24.27247059)
(0.0    0.03125   0.0     0.0304395   0.25     23.48747083)
(0.0    0.0325    0.0     0.030879    0.25     22.70247107)
(0.0    0.03375   0.0     0.0313185   0.25     21.91747131)
(0.0    0.035     0.0     0.031758    0.25     21.13247156)
(0.0    0.03625   0.0     0.0320745   0.25     20.52079257)
(0.0    0.0375    0.0     0.032391    0.25     19.90911358)
(0.0    0.03875   0.0     0.0327075   0.25     19.29743459)
(0.0    0.04      0.0     0.033024    0.25     18.6857556)
(0.0    0.04125   0.0     0.0332175   0.25     18.1973528)
(0.0    0.0425    0.0     0.033411    0.25     17.70895)
(0.0    0.04375   0.0     0.0336045   0.25     17.2205472)
(0.0    0.045     0.0     0.033798    0.25     16.7321444)
(0.0    0.04625   0.0     0.0338145   0.25     16.33402283)
(0.0    0.0475    0.0     0.033831    0.25     15.93590126)
(0.0    0.04875   0.0     0.0338475   0.25     15.53777969)
(0.0    0.05      0.0     0.033864    0.25     15.13965812)

